app/Helpers/jwtvalidate_helper.php

SELECT *
FROM `tbl_login`
WHERE `user_code_ref` = 'SKDCPL109'
AND `token` = 'eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpYXQiOjE3NjU4NjI5MjksImV4cCI6MTc2NTk0OTMyOSwidXNlcl9pZCI6IlNLRENQTDEwOSIsImVtYWlsIjoicHJpeWFAZ21haWwuY29tIn0.4AkazwIGI7Og4MIoe_WTaoOXtag773y95P5Bckt5p3E'
AND `is_active` = 'Y'
---
    function validatejwt(string $authHeader)
    {
        $secretKey = 'HS256';

        if (!$authHeader || !preg_match('/Bearer\s(\S+)/', $authHeader, $matches)) {
            return false;
        }
        $token = $matches[1];

        try {
            $decoded = JWT::decode($token, new Key($secretKey, 'HS256'));

            $userId = trim($decoded->user_id ?? '');

            $db = Database::connect();
            $user = $db->table('tbl_login')
                ->where('user_code_ref', $userId)
                ->where('token', $token)
                ->where('is_active', 'Y')
                ->get()
                ->getRow();