app/Controllers/AccountController.php

    public function getalltaxinvoicesswithcalculation()
    {
        helper('jwtvalidate');
        $authHeader = $this->request->getHeaderLine('Authorization');
        $decodedToken = validatejwt($authHeader);
        if (!$decodedToken) {
            return $this->respond(['status' => false, 'message' => 'Invalid or missing JWT'], 401);
        }

        $db = \Config\Database::connect();
        $company_code = $this->request->getGet('company_code');

        // 🔹 Base query: get ALL invoice columns + company name
        $builder = $db->table('tbl_tax_invoice as t')
            ->select('t.*, c.company_name')
            ->join('tbl_company as c', 't.company_code = c.company_code', 'left')
            ->where('t.is_active', 'Y');

        if ($company_code) {
            $builder->where('t.company_code', $company_code);
        }

        $invoices = $builder->get()->getResultArray();
---
SELECT `t`.*, `c`.`company_name`
FROM `tbl_tax_invoice` as `t`
LEFT JOIN `tbl_company` as `c` ON `t`.`company_code` = `c`.`company_code`
WHERE `t`.`is_active` = 'Y'