app/Controllers/AccountController.php

SELECT `p`.*, `c`.`company_name`, CONCAT(
                     COALESCE(r.First_Name, ""), " ", COALESCE(r.Middle, ""), " ", COALESCE(r.Last_Name, "")
                 ) as paid_by_name, `r`.`user_code`
FROM `tbl_payment_records` as `p`
LEFT JOIN `tbl_company` as `c` ON `p`.`company_code` = `c`.`company_code`
LEFT JOIN `tbl_register` as `r` ON `p`.`paid_by` = `r`.`user_code`
WHERE `p`.`is_active` = 'Y'
---
    public function get_all_payments()
    {
        $db = \Config\Database::connect();
        $company_code = $this->request->getGet('company_code');

        $builder = $db->table('tbl_payment_records as p')
            ->select('p.*, c.company_name,
                 CONCAT(
                     COALESCE(r.First_Name, ""),
                     " ",
                     COALESCE(r.Middle, ""),
                     " ",
                     COALESCE(r.Last_Name, "")
                 ) as paid_by_name,
                 r.user_code')
            ->join('tbl_company as c', 'p.company_code = c.company_code', 'left')
            ->join('tbl_register as r', 'p.paid_by = r.user_code', 'left')
            ->where('p.is_active', 'Y');

        if ($company_code) {
            $builder->where('p.company_code', $company_code);
        }

        $payments = $builder->get()->getResultArray();