app/Controllers/ClientController.php

    public function getAllClients()
    {
        helper(['jwtvalidate_helper']);
        $headers = $this->request->getServer('HTTP_AUTHORIZATION');

        if (!validatejwt($headers)) {
            return $this->respond(['status' => false, 'message' => 'Unauthorized or Invalid Token'], 401);
        }

        $decoded = validatejwt($headers);
        if (!$decoded) {
            return $this->respond(['status' => false, 'message' => 'Invalid or expired token'], 401);
        }

        $request = $this->request->getJSON(true);
        $client_code = $request['client_code'] ?? null;

        try {
            $builder = $this->db->table('tbl_client_mst');
            $builder->where('is_active', 'Y');

            if ($client_code) {
                $data = $builder->where('client_code', $client_code)->get()->getRow();
                if ($data) {
                    return $this->respond(['status' => true, 'data' => $data]);
                } else {
                    return $this->respond(['status' => false, 'message' => 'Client not found.'], 404);
                }
            } else {
                $data = $builder->get()->getResult();
---
SELECT *
FROM `tbl_client_mst`
WHERE `is_active` = 'Y'

    public function getMeetingReachedbysupportstaf()
    {
        helper('jwtvalidate');
        $authHeader = $this->request->getHeaderLine('Authorization');
        $decodedToken = validatejwt($authHeader);

        if (!$decodedToken) {
            return $this->respond([
                'status' => false,
                'message' => 'Invalid or missing JWT'
            ], 401);
        }

        $requestData  = $this->request->getJSON(true);
        $task_code  = $requestData['task_code'] ?? null;
        $reachedAt    = $requestData['reached_at'] ?? null;
        $db = \Config\Database::connect();
        $builder = $db->table('tbl_supportstaf_location');
        if ($task_code) {
            $builder->where('task_code', $task_code);
        }

        if ($reachedAt) {
            $builder->where('DATE(reached_at)', $reachedAt);
        }

        $query = $builder->get();
---
SELECT *
FROM `tbl_supportstaf_location`

            ], 404);
        }
        $executiveIds = array_unique(array_column($records, 'user_code'));
        $executives = $db->table('tbl_register')
            ->select('user_code, first_name, last_name')
            ->whereIn('user_code', $executiveIds)
            ->get()
            ->getResultArray();
---
SELECT `user_code`, `first_name`, `last_name`
FROM `tbl_register`
WHERE `user_code` IN ('SKDCPL025')