app/Controllers/CompanyController.php

SELECT *
FROM `tbl_company`
WHERE `is_active` = 'Y'
---
    public function  getallcompany()
    {
        helper('jwtvalidate');
        $authHeader = $this->request->getHeaderLine('Authorization');
        $decodedToken = validatejwt($authHeader);
        if (!$decodedToken) {
            return $this->respond([
                'status' => false,
                'message' => 'Invalid or missing JWT'
            ], 401);
        }
        $db = \Config\Database::connect();
        $companies = $db->table('tbl_company')
            ->where('is_active', 'Y')
            ->get()
            ->getResultArray();