app/Controllers/EmployeeController.php

    public function getAllEmployeeDetailsforreport()
    {
        helper(['jwtvalidate_helper', 'url']);
        $headers = $this->request->getServer('HTTP_AUTHORIZATION');

        if (!$headers) {
            return $this->respond(['status' => false, 'message' => 'Authorization header missing'], 401);
        }

        try {
            $employees = $this->db->table('tbl_employee_details AS ted')
                ->select('
                ted.*,
                tr.First_Name, tr.Last_Name, tr.Email AS register_email, tr.Phone_no AS register_phone_no,
                tr.company_Code, tr.role_ref_code, tr.team_lead_ref_code, tr.Note AS register_note,
                tl.user_name, tl.email AS login_email, tl.is_verified, tl.is_active AS login_is_active,
                tc.company_name, tc.address AS company_address, tc.email AS company_email,
                tc.pf_deduction, tc.contact_number, tc.website, tc.gst_number, tc.gst,
                tc.logo AS company_logo,
                td.designation_name,
                tdept.department_name,   -- ✅ Added department name
                tdept.department_code    -- (optional) include department_code if needed
            ')
                ->join('tbl_register AS tr', 'ted.user_code_ref = tr.user_code', 'left')
                ->join('tbl_login AS tl', 'ted.user_code_ref = tl.user_code_ref', 'left')
                ->join('tbl_company AS tc', 'tr.company_Code = tc.company_code', 'left')
                ->join('tbl_designation_mst AS td', 'tr.Designations = td.designation_code', 'left')
                ->join('tbl_department AS tdept', 'tr.department_code = tdept.department_code', 'left')
                ->where('ted.is_active', 'Y')
                ->where('tl.is_active', 'Y')   // ✅ only active logins
                ->get()
                ->getResult();
---
SELECT `ted`.*, `tr`.`First_Name`, `tr`.`Last_Name`, `tr`.`Email` AS `register_email`, `tr`.`Phone_no` AS `register_phone_no`, `tr`.`company_Code`, `tr`.`role_ref_code`, `tr`.`team_lead_ref_code`, `tr`.`Note` AS `register_note`, `tr`.`Designations` AS `designation_code`, `tdm`.`designation_name`, `tl`.`user_name`, `tl`.`email` AS `login_email`, `tl`.`is_verified`, `tl`.`is_active` AS `login_is_active`, `tc`.`company_name`, `tc`.`address` AS `company_address`, `tc`.`email` AS `company_email`, `tc`.`pf_deduction`, `tc`.`contact_number`, `tc`.`website`, `tc`.`gst_number`, `tc`.`gst`, `tc`.`logo` AS `company_logo`
FROM `tbl_employee_details` AS `ted`
LEFT JOIN `tbl_register` AS `tr` ON `ted`.`user_code_ref` = `tr`.`user_code`
LEFT JOIN `tbl_designation_mst` AS `tdm` ON `tr`.`Designations` = `tdm`.`designation_code`
LEFT JOIN `tbl_login` AS `tl` ON `ted`.`user_code_ref` = `tl`.`user_code_ref`
LEFT JOIN `tbl_company` AS `tc` ON `tr`.`company_Code` = `tc`.`company_code`
WHERE `ted`.`user_code_ref` = 'SKDCPL109'
AND `ted`.`is_active` = 'Y'

    public function getRegisterData()
    {
        helper(['jwtvalidate_helper']);
        $headers = $this->request->getServer('HTTP_AUTHORIZATION');
        if (!$headers) {
            return $this->respond(['status' => false, 'message' => 'Authorization header missing'], 401);
        }
        $decoded = validatejwt($headers);
        if (!$decoded) {
            return $this->respond(['status' => false, 'message' => 'Invalid or expired token'], 401);
        }
        $request = $this->request->getJSON(true);
        $user_code = $request['user_code'] ?? null;
        $data = $this->request->getJSON(true);
        $page = $data['page'] ?? null;
        $limit = $data['limit'] ?? null;
        // $offset = ($page - 1) * $limit;

        try {
            $builder = $this->db->table('tbl_register');

            // UPDATED: Sort alphabetically by first name, then last name
            $builder->orderBy('first_name', 'ASC');
            $builder->orderBy('last_name', 'ASC');

            $builder->where('is_active', 'Y');

            if ($user_code) {
                $data = $builder->where('user_code', $user_code)->get()->getRow();
---
SELECT *
FROM `tbl_register`
WHERE `is_active` = 'Y'
AND `user_code` = 'SKDCPL109'
ORDER BY `first_name` ASC, `last_name` ASC