app/Controllers/EmployeeController.php

SELECT *
FROM `tbl_register`
WHERE `is_active` = 'Y'
AND `user_code` = 'SKDCPL109'
ORDER BY `user_code` DESC
---
    public function getRegisterData()
    {
        helper(['jwtvalidate_helper']);
        $headers = $this->request->getServer('HTTP_AUTHORIZATION');
        if (!$headers) {
            return $this->respond(['status' => false, 'message' => 'Authorization header missing'], 401);
        }
        $decoded = validatejwt($headers);
        if (!$decoded) {
            return $this->respond(['status' => false, 'message' => 'Invalid or expired token'], 401);
        }
        $request = $this->request->getJSON(true);
        $user_code = $request['user_code'] ?? null;
        $data = $this->request->getJSON(true);
        $page = $data['page'] ?? 1;
        $limit = $data['limit'] ?? 10;
        $offset = ($page - 1) * $limit;
        try {
            $builder = $this->db->table('tbl_register');
            $builder->orderBy('user_code', 'DESC');
            $builder->where('is_active', 'Y');

            if ($user_code) {
                $data = $builder->where('user_code', $user_code)->get()->getRow();

SELECT *
FROM `tbl_emp_leaves_remains`
WHERE `user_ref_code` = 'SKDCPL112'
---
    public function getEmployeeLeavesbyUserCodeRef()
    {
        helper(['jwtvalidate_helper']);
        $headers = $this->request->getServer('HTTP_AUTHORIZATION');

        if (!validatejwt($headers)) {
            return $this->respond(['status' => false, 'message' => 'Unauthorized or Invalid Token'], 401);
        }

        $decoded = validatejwt($headers);
        if (!$decoded) {
            return $this->respond(['status' => false, 'message' => 'Invalid or expired token'], 401);
        }

        $request = $this->request->getJSON(true);
        $user_code_ref = $request['user_code_ref'] ?? null;

        if (empty($user_code_ref)) {
            return $this->respond(['status' => false, 'message' => 'user_code_ref is required.'], 400);
        }

        try {
            $leaves = $this->db->table('tbl_emp_leaves_remains')
                ->where('user_ref_code', $user_code_ref)
                ->get()
                ->getResult();