app/Controllers/EventController.php

    public function get_upcoming_events()
    {
        helper('jwtvalidate');
        $authHeader = $this->request->getHeaderLine('Authorization');
        $decodedToken = validatejwt($authHeader);
        if (!$decodedToken) {
            return $this->respond(['status' => false, 'message' => 'Invalid or missing JWT'], 401);
        }
        try {
            $db = \Config\Database::connect();
            $today = date('Y-m-d');
            $events = $db->table('tbl_event_mst')
                ->where('is_active', 'Y')
                ->where('DATE(to_date) >=', $today)
                ->orderBy('from_date', 'ASC')
                ->get()
                ->getResultArray();
---
SELECT *
FROM `tbl_event_mst`
WHERE `is_active` = 'Y'
AND DATE(to_date) >= '2025-12-05'
ORDER BY `from_date` ASC