app/Controllers/LeaveController.php

    public function getuserattendance()
    {
        helper('jwtvalidate');
        $authHeader = $this->request->getHeaderLine('Authorization');
        $decodedToken = validatejwt($authHeader);
        if (!$decodedToken) {
            return $this->respond([
                'status' => false,
                'message' => 'Invalid or missing JWT'
            ], 401);
        }
        $userCode = $decodedToken->user_id ?? null;
        if (!$userCode) {
            return $this->respond([
                'status' => false,
                'message' => 'User not found in token'
            ], 400);
        }
        $db = \Config\Database::connect();
        $builder = $db->table('tbl_time');
        $builder->where('user_ref_code', $userCode);
        $query = $builder->get();
---
SELECT *
FROM `tbl_time`
WHERE `user_ref_code` = 'SKDCPL109'