app/Controllers/LeaveController.php

SELECT `joining_date`, `role_ref_code`, `first_name`, `last_name`
FROM `tbl_register`
WHERE `user_code` = 'SKDCPL109'
AND `is_active` = 'Y'
---
    public function getEmployeeLeaveInfo()
    {
        helper('jwtvalidate');
        $authHeader = $this->request->getHeaderLine('Authorization');
        $decodedToken = validatejwt($authHeader);

        if (!$decodedToken) {
            return $this->respond([
                'status' => false,
                'message' => 'Invalid or missing JWT'
            ], 401);
        }

        $user_ref_code = $decodedToken->user_id;

        // Also check if user_ref_code is passed in request body
        if ($this->request->getMethod() === 'post') {
            $input = $this->request->getJSON(true);
            if (isset($input['user_ref_code'])) {
                $user_ref_code = $input['user_ref_code'];
            }
        }

        try {
            // Get user details
            $user = $this->db->table('tbl_register')
                ->select('joining_date, role_ref_code, first_name, last_name')
                ->where('user_code', $user_ref_code)
                ->where('is_active', 'Y')
                ->get()
                ->getRow();

SELECT SUM(`total_days`) AS `total_paid`
FROM `tbl_leave_forms`
WHERE `user_ref_code` = 'SKDCPL109'
AND `leave_code` = 'PAID'
AND `status` = 'APPROVED'
AND YEAR(start_date) = 2025
---
            }

            // Get paid leaves taken in current year
            $paidResult = $this->db->table('tbl_leave_forms')
                ->selectSum('total_days', 'total_paid')
                ->where('user_ref_code', $user_ref_code)
                ->where('leave_code', 'PAID')
                ->where('status', 'APPROVED')
                ->where('YEAR(start_date)', $currentYear)
                ->get()
                ->getRow();

SELECT SUM(`total_days`) AS `total_paid_pending`
FROM `tbl_leave_forms`
WHERE `user_ref_code` = 'SKDCPL109'
AND `leave_code` = 'PAID'
AND `status` = 'PENDING'
---
            $monthlyBreakdown = $this->getMonthlyLeaveBreakdown($user_ref_code, $currentYear, $currentMonth, $isAdmin, $probationEndDate);

            // Get paid leaves pending
            $paidPendingResult = $this->db->table('tbl_leave_forms')
                ->selectSum('total_days', 'total_paid_pending')
                ->where('user_ref_code', $user_ref_code)
                ->where('leave_code', 'PAID')
                ->where('status', 'PENDING')
                ->get()
                ->getRow();

SELECT SUM(`total_days`) AS `total_wfh`
FROM `tbl_leave_forms`
WHERE `user_ref_code` = 'SKDCPL109'
AND `leave_code` = 'WFH'
AND `status` IN ('APPROVED','AUTO_APPROVED')
SELECT SUM(`total_days`) AS `total_wfh_pending`
FROM `tbl_leave_forms`
WHERE `user_ref_code` = 'SKDCPL109'
AND `leave_code` = 'WFH'
AND `status` = 'PENDING'
SELECT SUM(`total_days`) AS `total_unpaid`
FROM `tbl_leave_forms`
WHERE `user_ref_code` = 'SKDCPL109'
AND `leave_code` = 'UNPAID'
AND `status` = 'APPROVED'
SELECT SUM(`total_days`) AS `total_unpaid_pending`
FROM `tbl_leave_forms`
WHERE `user_ref_code` = 'SKDCPL109'
AND `leave_code` = 'UNPAID'
AND `status` = 'PENDING'
---
            $paidPending = floatval($paidPendingResult->total_paid_pending ?? 0);

            // Get other leave types
            $wfhResult = $this->db->table('tbl_leave_forms')
                ->selectSum('total_days', 'total_wfh')
                ->where('user_ref_code', $user_ref_code)
                ->where('leave_code', 'WFH')
                ->whereIn('status', ['APPROVED', 'AUTO_APPROVED'])
                ->get()
                ->getRow();

            $wfhTaken = floatval($wfhResult->total_wfh ?? 0);

            $wfhPendingResult = $this->db->table('tbl_leave_forms')
                ->selectSum('total_days', 'total_wfh_pending')
                ->where('user_ref_code', $user_ref_code)
                ->where('leave_code', 'WFH')
                ->where('status', 'PENDING')
                ->get()
                ->getRow();

            $wfhPending = floatval($wfhPendingResult->total_wfh_pending ?? 0);

            $unpaidResult = $this->db->table('tbl_leave_forms')
                ->selectSum('total_days', 'total_unpaid')
                ->where('user_ref_code', $user_ref_code)
                ->where('leave_code', 'UNPAID')
                ->where('status', 'APPROVED')
                ->get()
                ->getRow();

            $unpaidTaken = floatval($unpaidResult->total_unpaid ?? 0);

            $unpaidPendingResult = $this->db->table('tbl_leave_forms')
                ->selectSum('total_days', 'total_unpaid_pending')
                ->where('user_ref_code', $user_ref_code)
                ->where('leave_code', 'UNPAID')
                ->where('status', 'PENDING')
                ->get()
                ->getRow();

SELECT SUM(`total_days`) AS `monthly_taken`
FROM `tbl_leave_forms`
WHERE `user_ref_code` = 'SKDCPL109'
AND `leave_code` = 'PAID'
AND `status` = 'APPROVED'
AND `start_date` >= '2025-01-01'
AND `start_date` <= '2025-01-31'
---
    private function getMonthlyLeaveBreakdown($userRefCode, $year, $currentMonth, $isAdmin, $probationEndDate)
    {
        $breakdown = [];

        // For admin, all months have 1 leave
        $monthlyAllocation = $isAdmin ? 1 : 0;

        for ($month = 1; $month <= $currentMonth; $month++) {
            $monthDate = new DateTime($year . '-' . str_pad($month, 2, '0', STR_PAD_LEFT) . '-01', $this->kolkataTimezone);

            // Check if month is after probation for non-admin
            if (!$isAdmin) {
                $monthlyAllocation = ($monthDate >= $probationEndDate) ? 1 : 0;
            }

            // Get leaves taken in this month
            $monthStart = $year . '-' . str_pad($month, 2, '0', STR_PAD_LEFT) . '-01';
            $monthEnd = date('Y-m-t', strtotime($monthStart));

            $takenResult = $this->db->table('tbl_leave_forms')
                ->selectSum('total_days', 'monthly_taken')
                ->where('user_ref_code', $userRefCode)
                ->where('leave_code', 'PAID')
                ->where('status', 'APPROVED')
                ->where('start_date >=', $monthStart)
                ->where('start_date <=', $monthEnd)
                ->get()
                ->getRow();

SELECT `lf`.*, `r`.`first_name`, `r`.`last_name`, `r`.`joining_date`, `r`.`role_ref_code`
FROM `tbl_leave_forms` `lf`
LEFT JOIN `tbl_register` `r` ON `lf`.`user_ref_code` = `r`.`user_code`
ORDER BY `lf`.`created_at` DESC
---
    public function getallleave()
    {
        helper('jwtvalidate');
        $authHeader = $this->request->getHeaderLine('Authorization');
        $decodedToken = validatejwt($authHeader);

        if (!$decodedToken) {
            return $this->respond([
                'status' => false,
                'message' => 'Invalid or missing JWT'
            ], 401);
        }

        try {
            $builder = $this->db->table('tbl_leave_forms lf');
            $result = $builder
                ->select('lf.*, r.first_name, r.last_name, r.joining_date, r.role_ref_code')
                ->join('tbl_register r', 'lf.user_ref_code = r.user_code', 'left')
                ->orderBy('lf.created_at', 'DESC')
                ->get()
                ->getResult();

SELECT `lf`.*, `r`.`first_name`, `r`.`last_name`
FROM `tbl_leave_forms` `lf`
LEFT JOIN `tbl_register` `r` ON `lf`.`user_ref_code` = `r`.`user_code`
WHERE `lf`.`start_date` <= '2025-12-16'
AND `lf`.`end_date` >= '2025-12-16'
AND `lf`.`status` = 'APPROVED'
ORDER BY `lf`.`created_at` DESC
---
    public function gettodayleaveemployee()
    {
        helper('jwtvalidate');
        $authHeader = $this->request->getHeaderLine('Authorization');
        $decodedToken = validatejwt($authHeader);

        if (!$decodedToken) {
            return $this->respond([
                'status' => false,
                'message' => 'Invalid or missing JWT'
            ], 401);
        }

        // Use Kolkata timezone for today's date
        $today = (new DateTime('now', $this->kolkataTimezone))->format('Y-m-d');

        try {
            $builder = $this->db->table('tbl_leave_forms lf');

            $builder->select('lf.*, r.first_name, r.last_name')
                ->join('tbl_register r', 'lf.user_ref_code = r.user_code', 'left')
                ->where('lf.start_date <=', $today)
                ->where('lf.end_date >=', $today)
                ->where('lf.status', 'APPROVED')
                ->orderBy('lf.created_at', 'DESC');

            $result = $builder->get()->getResult();

SELECT *
FROM `tbl_time`
WHERE `user_ref_code` = 'SKDCPL109'
---
    public function getuserattendance()
    {
        helper('jwtvalidate');
        $authHeader = $this->request->getHeaderLine('Authorization');
        $decodedToken = validatejwt($authHeader);
        if (!$decodedToken) {
            return $this->respond([
                'status' => false,
                'message' => 'Invalid or missing JWT'
            ], 401);
        }
        $userCode = $decodedToken->user_id ?? null;
        if (!$userCode) {
            return $this->respond([
                'status' => false,
                'message' => 'User not found in token'
            ], 400);
        }
        $db = \Config\Database::connect();
        $builder = $db->table('tbl_time');
        $builder->where('user_ref_code', $userCode);
        $query = $builder->get();