app/Controllers/LettarsController.php

    public function getAllExperienceLetters()
    {
        helper(['jwtvalidate_helper']);
        $headers = $this->request->getServer('HTTP_AUTHORIZATION');

        // ✅ Validate JWT
        if (!validatejwt($headers)) {
            return $this->respond(['status' => false, 'message' => 'Invalid token'], 401);
        }

        try {
            $db = \Config\Database::connect();

            // ✅ Join experience letters with employee and company tables
            $query = $db->table('tbl_experience_letter AS tel')
                ->select('
                tel.*,
                r.first_name,
                r.middle,
                r.last_name,
                tc.company_name as companyname,
                tc.logo AS company_logo,
                tc.address AS company_address,
                tc.email AS company_email,
                d.designation_name
            ')
                ->join('tbl_register AS r', 'tel.employee_code = r.user_code', 'left')
                ->join('tbl_company AS tc', 'tel.company_name = tc.company_code', 'left')
                ->join('tbl_designation_mst AS d', 'tel.designation = d.designation_name', 'left')
                ->where('tel.is_active', 'Y')
                ->orderBy('tel.created_at', 'DESC')
                ->get()
                ->getResult();
---
SELECT `tel`.*, `r`.`first_name`, `r`.`middle`, `r`.`last_name`, `tc`.`company_name` as `companyname`, `tc`.`logo` AS `company_logo`, `tc`.`address` AS `company_address`, `tc`.`email` AS `company_email`, `d`.`designation_name`
FROM `tbl_experience_letter` AS `tel`
LEFT JOIN `tbl_register` AS `r` ON `tel`.`employee_code` = `r`.`user_code`
LEFT JOIN `tbl_company` AS `tc` ON `tel`.`company_name` = `tc`.`company_code`
LEFT JOIN `tbl_designation_mst` AS `d` ON `tel`.`designation` = `d`.`designation_name`
WHERE `tel`.`is_active` = 'Y'
ORDER BY `tel`.`created_at` DESC