app/Controllers/MeetingController.php

    public function get_upcoming_meetings()
    {
        helper('jwtvalidate');
        $authHeader = $this->request->getHeaderLine('Authorization');
        $decodedToken = validatejwt($authHeader);

        if (!$decodedToken) {
            return $this->respond(['status' => false, 'message' => 'Invalid or missing JWT'], 401);
        }

        $db = \Config\Database::connect();
        $now = date('Y-m-d H:i:s'); // current datetime

        $meetings = $db->table('tbl_meetings')
            ->where('is_active', 'Y')
            ->where("CONCAT(meeting_date, ' ', meeting_time) >", $now)
            ->orderBy('meeting_date', 'ASC')
            ->orderBy('meeting_time', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_meetings`
WHERE `is_active` = 'Y'
AND CONCAT(meeting_date, ' ', meeting_time) > '2025-12-05 16:39:21'
ORDER BY `meeting_date` ASC, `meeting_time` ASC