app/Controllers/MultiuseController.php

SELECT `url_code`
FROM `tbl_access_level_by_user`
WHERE `user_ref_code` = 'SKDCPL109'
---
    public function get_accesslevelsby_usercode()
    {
        helper('jwtvalidate');
        $authHeader = $this->request->getHeaderLine('Authorization');
        $decodedToken = validatejwt($authHeader);
        if (!$decodedToken) {
            return $this->respond([
                'status' => false,
                'message' => 'Invalid or missing JWT'
            ], 401);
        }
        $userCode = $decodedToken->user_id ?? null;
        if (!$userCode) {
            return $this->respond([
                'status' => false,
                'message' => 'User code not found in token'
            ], 400);
        }
        $db = \Config\Database::connect();
        try {
            $row = $db->table('tbl_access_level_by_user')
                ->select('url_code')
                ->where('user_ref_code', $userCode)
                ->get()
                ->getRow();

SELECT `a`.*, CONCAT(r.First_Name, " ", r.Last_Name) as employee_name
FROM `tbl_achievement` `a`
LEFT JOIN `tbl_register` `r` ON `a`.`employee_code` = `r`.`user_code`
WHERE `a`.`day_of_achievement` = '2025-12-16'
---
    public function getTodayAchievements()
    {
        helper(['jwtvalidate_helper']);
        $headers = $this->request->getServer('HTTP_AUTHORIZATION');
        $decoded = validatejwt($headers);

        if (!$decoded) {
            return $this->respond(['status' => false, 'message' => 'Unauthorized or Invalid Token'], 401);
        }

        $today = (new \DateTime('now', new \DateTimeZone('Asia/Kolkata')))->format('Y-m-d');
        $db = \Config\Database::connect();

        $achievements = $db->table('tbl_achievement a')
            ->select('a.*, CONCAT(r.First_Name, " ", r.Last_Name) as employee_name')
            ->join('tbl_register r', 'a.employee_code = r.user_code', 'left')
            ->where('a.day_of_achievement', $today)
            ->get()
            ->getResult();