app/Controllers/ProjectController.php

    public function getAllTasks()
    {
        helper(['jwtvalidate_helper', 'url']);
        $headers = $this->request->getServer('HTTP_AUTHORIZATION');

        if (!validatejwt($headers)) {
            return $this->respond(['status' => false, 'message' => 'Unauthorized or Invalid Token'], 401);
        }

        $decoded = validatejwt($headers);
        if (!$decoded) {
            return $this->respond(['status' => false, 'message' => 'Invalid or expired token'], 401);
        }

        $request = $this->request->getJSON(true);
        $task_code = $request['task_code'] ?? null;
        $project_code = $request['project_code'] ?? null;
        $assigned_to = $request['assigned_to'] ?? null;

        try {
            $builder = $this->db->table('tbl_task_mst AS ttm')
                ->select('ttm.*,
              tpm.project_name, tpm.description AS project_description,
              tpm.client_name, tpm.client_contact, tpm.start_date AS project_start_date,
              tpm.end_date AS project_end_date, tpm.status AS project_status,
              tpm.budget, tpm.team_lead, tpm.company_code,
              CONCAT(tr.first_name, " ", tr.last_name) AS assigned_to_name') // Add full name
                ->join('tbl_project_mst AS tpm', 'ttm.project_code = tpm.project_code', 'left')
                ->join('tbl_register AS tr', 'ttm.assigned_to = tr.user_code', 'left') // Join tbl_register
                ->where('ttm.is_active', 'Y')
                ->where('tpm.is_active', 'Y');
---
SELECT `ttm`.*, `tpm`.`project_name`, `tpm`.`description` AS `project_description`, `tpm`.`client_name`, `tpm`.`client_contact`, `tpm`.`start_date` AS `project_start_date`, `tpm`.`end_date` AS `project_end_date`, `tpm`.`status` AS `project_status`, `tpm`.`budget`, `tpm`.`team_lead`, `tpm`.`company_code`, CONCAT(tr.first_name, " ", tr.last_name) AS assigned_to_name
FROM `tbl_task_mst` AS `ttm`
LEFT JOIN `tbl_project_mst` AS `tpm` ON `ttm`.`project_code` = `tpm`.`project_code`
LEFT JOIN `tbl_register` AS `tr` ON `ttm`.`assigned_to` = `tr`.`user_code`
WHERE `ttm`.`is_active` = 'Y'
AND `tpm`.`is_active` = 'Y'