app/Models/SalaryModel.php

    public function getAttendanceDataWithCount($userCode, $month)
    {
        $allDays = [];
        $presentDays = [];
        $latePenalties = [];
        $daysInMonth = date('t', strtotime($month . '-01'));
        $holidayDates = [];

        // 🔹 Get all holidays for this month
        $holidayQuery = $this->db->table('tbl_holiday_mst')
            ->select('holiday_date')
            ->where('is_active', 'Y')
            ->where("DATE_FORMAT(holiday_date, '%Y-%m') =", $month)
            ->get();
---
SELECT `holiday_date`
FROM `tbl_holiday_mst`
WHERE `is_active` = 'Y'
AND DATE_FORMAT(holiday_date, '%Y-%m') = '2025-10'

            $allDays[] = $date;

            // 🔹 Check attendance
            $attendanceQuery = $this->db->table('tbl_time')
                ->where('user_ref_code', $userCode)
                ->where('today_date', $date)
                ->where('is_active', 'Y')
                ->get();
---
SELECT *
FROM `tbl_time`
WHERE `user_ref_code` = 'SKDCPL109'
AND `today_date` = '2025-10-01'
AND `is_active` = 'Y'